In [1]:
import pandas as pd

In [4]:
df=pd.read_csv('birth.csv')

In [5]:
df.head()

         date  births
0  1959-01-01      35
1  1959-01-02      32
2  1959-01-03      30
3  1959-01-04      31
4  1959-01-05      44

In [7]:
df['date'].dtype

dtype('O')

In [11]:
df2=pd.read_csv('birth.csv',parse_dates=[0]) # parse_dates=[0] makes the first column date_time format

In [12]:
df2.head()

        date  births
0 1959-01-01      35
1 1959-01-02      32
2 1959-01-03      30
3 1959-01-04      31
4 1959-01-05      44

In [14]:
df2['date'].dtype

dtype('<M8[ns]')

# Loading data as a series

In [18]:
series=pd.read_csv('birth.csv',header=0,parse_dates=[0],index_col=0,squeeze=True)    # parse_dates[0] because date is in the first column, first column indicates [0]. Then we need to make the date time column as our index

In [19]:
series.head()

date
1959-01-01    35
1959-01-02    32
1959-01-03    30
1959-01-04    31
1959-01-05    44
Name: births, dtype: int64

# Exploring Time Series Data

In [21]:
series.shape

(365,)

In [22]:
df2.shape

(365, 2)

# Querying by time

In [23]:
print(series['1959-01'])

date
1959-01-01    35
1959-01-02    32
1959-01-03    30
1959-01-04    31
1959-01-05    44
1959-01-06    29
1959-01-07    45
1959-01-08    43
1959-01-09    38
1959-01-10    27
1959-01-11    38
1959-01-12    33
1959-01-13    55
1959-01-14    47
1959-01-15    45
1959-01-16    37
1959-01-17    50
1959-01-18    43
1959-01-19    41
1959-01-20    52
1959-01-21    34
1959-01-22    53
1959-01-23    39
1959-01-24    32
1959-01-25    37
1959-01-26    43
1959-01-27    39
1959-01-28    35
1959-01-29    44
1959-01-30    38
1959-01-31    24
Name: births, dtype: int64

# Querying within a specific date

df2[(df2['date']>'1959-01-02') &(df2['date']<='1959-01-22')]

In [25]:
df2[(df2['date']>'1959-01-02') &(df2['date']<='1959-01-22')] #It shows the value in between 2nd January to 22 January

         date  births
2  1959-01-03      30
3  1959-01-04      31
4  1959-01-05      44
5  1959-01-06      29
6  1959-01-07      45
7  1959-01-08      43
8  1959-01-09      38
9  1959-01-10      27
10 1959-01-11      38
11 1959-01-12      33
12 1959-01-13      55
13 1959-01-14      47
14 1959-01-15      45
15 1959-01-16      37
16 1959-01-17      50
17 1959-01-18      43
18 1959-01-19      41
19 1959-01-20      52
20 1959-01-21      34
21 1959-01-22      53

In [26]:
series.describe()

count    365.000000
mean      41.980822
std        7.348257
min       23.000000
25%       37.000000
50%       42.000000
75%       46.000000
max       73.000000
Name: births, dtype: float64

In [27]:
df2.describe()

           births
count  365.000000
mean    41.980822
std      7.348257
min     23.000000
25%     37.000000
50%     42.000000
75%     46.000000
max     73.000000